In [1]:
import pandas as pd
import numpy as np

In [2]:

#  with float()

def with_billion(bill):
    cut = str(bill)
    if (bill > 999999999) & (bill < 10000000000):
        '''One billion 1,000,000,000 '''
        bill_cut = float(f"{cut[0]}.{cut[1:]}")
        return(f'{bill_cut:.1f} Billion')
    elif (bill > 9999999999) & (bill < 100000000000):
        '''Two billion 10,000,000,000 '''
        bill_cut = float(f"{cut[:2]}.{cut[2:]}")
        return(f'{bill_cut:.1f} Billion')
    elif( bill > 99999999999) & (bill < 1000000000000):
        '''One billion 100,000,000,000 '''
        bill_cut = float(f"{cut[:3]}.{cut[3:]}")
        return(f'{bill_cut:.1f} Billion')

#  with just indexing and slicing

def billion(bill):
    cut = str(bill)
    if (bill > 999999999) & (bill < 10000000000):
        '''One billion 1,000,000,000 '''
        bill_cut = (f"{cut[0]}.{cut[1:]}")
        return(f'{bill_cut[:3]} Billion')
    elif (bill > 9999999999) & (bill < 100000000000):
        '''Two billion 10,000,000,000 '''
        bill_cut = (f"{cut[:2]}.{cut[2:]}")
        return(f'{bill_cut[:4]} Billion')
    elif( bill > 99999999999) & (bill < 1000000000000):
        '''One billion 100,000,000,000 '''
        bill_cut = (f"{cut[:3]}.{cut[3:]}")
        return(f'{bill_cut[:5]} Billion')
billion(100000000000)

'100.0 Billion'

In [3]:
data1 = pd.read_csv('constituents-financials.csv')
data2 = pd.read_csv('constituents.csv')

In [4]:
mylist = list()
my_set = list()
for item in (data2['Sector']):
    se = str(item).split(',')
    mylist.extend(se)
for i in mylist:
    it=set(i)
    my_set.append(mylist.count(i))
print(list(set(my_set)),mylist.count('Materials'))
list(set(mylist))

[32, 33, 34, 67, 68, 3, 70, 84, 25, 28, 61] 25

['Materials',
 'Health Care',
 'Utilities',
 'Consumer Discretionary',
 'Real Estate',
 'Energy',
 'Financials',
 'Information Technology',
 'Consumer Staples',
 'Industrials',
 'Telecommunication Services']

In [5]:
def occurrance(where):
    count = dict()
    for sector in data2[where]:
        if sector in count:
            count[sector] += 1
        else:
            count[sector] = 1
    return(count)

In [6]:
occurrance('Sector')

{'Industrials': 67,
 'Health Care': 61,
 'Information Technology': 70,
 'Consumer Discretionary': 84,
 'Utilities': 28,
 'Financials': 68,
 'Materials': 25,
 'Real Estate': 33,
 'Consumer Staples': 34,
 'Energy': 32,
 'Telecommunication Services': 3}

In [7]:
np.random.seed(101)
mydata = np.random.randint(0,101,(4,3))

In [8]:
mydata

array([[95, 11, 81],
       [70, 63, 87],
       [75,  9, 77],
       [40,  4, 63]])

In [9]:
myindex = ['CA','NY','AZ','TX']
mycolumns = ['Jan','Feb','Mar']

In [10]:
df = pd.DataFrame(mydata,myindex,mycolumns)

In [11]:
df

    Jan  Feb  Mar
CA   95   11   81
NY   70   63   87
AZ   75    9   77
TX   40    4   63

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, CA to TX
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Jan     4 non-null      int32
 1   Feb     4 non-null      int32
 2   Mar     4 non-null      int32
dtypes: int32(3)
memory usage: 80.0+ bytes

In [13]:
pwd

'C:\\Users\\princ\\Documents\\Ncair\\Python_For_Finance\\Python-Finance-QuantConnect\\03-Core-Pandas'

In [14]:
ls

 Volume in drive C is Windows 10
 Volume Serial Number is 84BB-FC38

 Directory of C:\Users\princ\Documents\Ncair\Python_For_Finance\Python-Finance-QuantConnect\03-Core-Pandas

23/01/2023  12:26    <DIR>          .
10/12/2022  10:27    <DIR>          ..
17/01/2023  10:15    <DIR>          .ipynb_checkpoints
19/01/2023  14:38    <DIR>          __pycache__
20/12/2022  12:01           662,929 00-Series.ipynb
29/12/2022  09:36           208,970 01-DataFrames.ipynb
14/01/2023  13:51           164,391 02-Conditional-Filtering.ipynb
12/01/2023  10:19           196,398 03-Useful-Methods.ipynb
17/01/2023  10:15            62,979 04-Combining-DataFrames.ipynb
28/09/2021  02:16            65,234 05-Inputs-and-Outputs.ipynb
23/01/2023  12:20           115,736 06-Core-Pandas-Finance-Exercise.ipynb
28/09/2021  02:16            66,826 07-Core-Pandas-Finance-Exercise-SOLUTIONS.ipynb
28/09/2021  02:16            18,676 constituents.csv
28/09/2021  02:16            73,270 constituents-financials.csv
23/01/2023  12:26            43,481 dataframe testing.ipynb
28/09/2021  02:16                46 example.csv
28/09/2021  02:16             5,022 example.xlsx
28/09/2021  02:16        24,992,926 hotel_booking_data.csv
28/09/2021  02:16               171 movie_scores.csv
28/09/2021  02:16            17,727 mpg.csv
28/09/2021  02:16             5,022 my_excel_file.xlsx
28/09/2021  02:16                46 new_file.csv
28/09/2021  02:16             5,021 new_workbook.xlsx
28/09/2021  02:16                46 newfile.csv
19/01/2023  13:17             1,492 pandas_module.py
28/09/2021  02:16            52,132 reshaping_pivot.png
28/09/2021  02:16             5,459 RetailSales_BeerWineLiquor.csv
28/09/2021  02:16             1,302 Sales_Funnel_CRM.csv
28/09/2021  02:16             1,330 sample_table.html
28/09/2021  02:16               555 simple.html
12/01/2023  10:09            12,034 testing pd.ipynb
07/01/2023  17:16             1,331 testing_html.html
28/09/2021  02:16            18,507 tips.csv
              29 File(s)     26,799,059 bytes
               4 Dir(s)  597,866,242,048 bytes free

In [15]:
df = pd.read_csv('C:\\Users\\princ\\Documents\\Ncair\\Python_For_Finance\\Python-Finance-QuantConnect\\03-Core-Pandas\\tips.csv')

In [16]:
df

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251
...,...,...,...,...,...,...,...,...,...,...,...
239,29.03,5.92,Male,No,Sat,Dinner,3,9.68,Michael Avila,5296068606052842,Sat2657
240,27.18,2.00,Female,Yes,Sat,Dinner,2,13.59,Monica Sanders,3506806155565404,Sat1766
241,22.67,2.00,Male,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196,Sat3880
242,17.82,1.75,Male,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950,Sat17
243,18.78,3.00,Female,No,Thur,Dinner,2,9.39,Michelle Hardin,3511451626698139,Thur672

In [17]:
df.columns

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size',
       'price_per_person', 'Payer Name', 'CC Number', 'Payment ID'],
      dtype='object')

In [18]:
df.index

RangeIndex(start=0, stop=244, step=1)

In [19]:
df.head(10)
df.tail(10)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 11 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   total_bill        244 non-null    float64
 1   tip               244 non-null    float64
 2   sex               244 non-null    object
 3   smoker            244 non-null    object
 4   day               244 non-null    object
 5   time              244 non-null    object
 6   size              244 non-null    int64
 7   price_per_person  244 non-null    float64
 8   Payer Name        244 non-null    object
 9   CC Number         244 non-null    int64
 10  Payment ID        244 non-null    object
dtypes: float64(3), int64(2), object(6)
memory usage: 21.1+ KB

In [20]:
df.describe().transpose()

,count,mean,std,min,25%,50%,75%,max
total_bill,244.0,1.978594e+01,8.902412e+00,3.070000e+00,1.334750e+01,1.779500e+01,2.412750e+01,5.081000e+01
tip,244.0,2.998279e+00,1.383638e+00,1.000000e+00,2.000000e+00,2.900000e+00,3.562500e+00,1.000000e+01
size,244.0,2.569672e+00,9.510998e-01,1.000000e+00,2.000000e+00,2.000000e+00,3.000000e+00,6.000000e+00
price_per_person,244.0,7.888197e+00,2.914234e+00,2.880000e+00,5.800000e+00,7.255000e+00,9.390000e+00,2.027000e+01
CC Number,244.0,2.563496e+15,2.369340e+15,6.040679e+10,3.040731e+13,3.525318e+15,4.553675e+15,6.596454e+15

In [21]:
options=['sat','sun']

In [22]:
df['day'].isin(options)

0      False
1      False
2      False
3      False
4      False
       ...
239    False
240    False
241    False
242    False
243    False
Name: day, Length: 244, dtype: bool

In [23]:
def reverse_grab(num,len=4):
    '''
    pass an int to num
    '''
    return(str(num)[-len:])

In [24]:
reverse_grab(123456789)

'6789'

In [25]:
df["CC Number"].apply(reverse_grab)

0      3410
1      9230
2      1322
3      5994
4      7221
       ...
239    2842
240    5404
241    7196
242    0950
243    8139
Name: CC Number, Length: 244, dtype: object

In [26]:
def Price(price):
    if price < 10:
        return '$'
    elif price >= 10 and price < 30:
        return '$$'
    else:
        return '$$$'

In [27]:
df['total_bill'].apply(Price)

0      $$
1      $$
2      $$
3      $$
4      $$
       ..
239    $$
240    $$
241    $$
242    $$
243    $$
Name: total_bill, Length: 244, dtype: object

In [28]:
def quality(total,tip):
    if tip/total>0.25:
        return 'Generous'
    else:
        return "Other"

In [29]:
one = df[["total_bill",'tip']].apply(lambda df: quality(df['total_bill'],df['tip']),1)

In [30]:
two=np.vectorize(quality)(df['total_bill'],df['tip'])

In [31]:
two

array(['Other', 'Other', 'Other', 'Other', 'Other', 'Other', 'Other',
       'Other', 'Other', 'Other', 'Other', 'Other', 'Other', 'Other',
       'Other', 'Other', 'Other', 'Other', 'Other', 'Other', 'Other',
       'Other', 'Other', 'Other', 'Other', 'Other', 'Other', 'Other',
       'Other', 'Other', 'Other', 'Other', 'Other', 'Other', 'Other',
       'Other', 'Other', 'Other', 'Other', 'Other', 'Other', 'Other',
       'Other', 'Other', 'Other', 'Other', 'Other', 'Other', 'Other',
       'Other', 'Other', 'Generous', 'Other', 'Other', 'Other', 'Other',
       'Other', 'Other', 'Other', 'Other', 'Other', 'Other', 'Other',
       'Other', 'Other', 'Other', 'Other', 'Generous', 'Other', 'Other',
       'Other', 'Other', 'Other', 'Other', 'Other', 'Other', 'Other',
       'Other', 'Other', 'Other', 'Other', 'Other', 'Other', 'Other',
       'Other', 'Other', 'Other', 'Other', 'Other', 'Other', 'Other',
       'Other', 'Other', 'Generous', 'Other', 'Other', 'Other', 'Other',
       'Other', 'Other', 'Other', 'Other', 'Other', 'Other', 'Other',
       'Other', 'Other', 'Other', 'Other', 'Generous', 'Other', 'Other',
       'Other', 'Other', 'Other', 'Other', 'Other', 'Other', 'Other',
       'Other', 'Other', 'Other', 'Other', 'Other', 'Other', 'Other',
       'Other', 'Other', 'Other', 'Other', 'Other', 'Other', 'Other',
       'Other', 'Other', 'Other', 'Other', 'Other', 'Other', 'Other',
       'Other', 'Other', 'Other', 'Other', 'Other', 'Other', 'Other',
       'Other', 'Other', 'Generous', 'Other', 'Other', 'Other', 'Other',
       'Other', 'Other', 'Other', 'Other', 'Other', 'Other', 'Other',
       'Other', 'Other', 'Other', 'Other', 'Other', 'Other', 'Other',
       'Other', 'Other', 'Other', 'Other', 'Generous', 'Other', 'Other',
       'Other', 'Other', 'Other', 'Generous', 'Other', 'Other', 'Other',
       'Other', 'Generous', 'Other', 'Other', 'Other', 'Other', 'Other',
       'Other', 'Other', 'Other', 'Other', 'Other', 'Other', 'Other',
       'Other', 'Other', 'Other', 'Other', 'Other', 'Other', 'Other',
       'Other', 'Other', 'Other', 'Other', 'Other', 'Other', 'Other',
       'Other', 'Other', 'Other', 'Other', 'Other', 'Other', 'Other',
       'Other', 'Other', 'Other', 'Other', 'Generous', 'Other', 'Other',
       'Other', 'Other', 'Other', 'Other', 'Other', 'Other', 'Other',
       'Other', 'Generous', 'Other', 'Other', 'Other', 'Other', 'Other',
       'Other', 'Other', 'Other', 'Other', 'Other', 'Other'], dtype='<U8')

In [32]:
one

0      Other
1      Other
2      Other
3      Other
4      Other
       ...
239    Other
240    Other
241    Other
242    Other
243    Other
Length: 244, dtype: object

In [33]:
import timeit
stup='''
import pandas as pd
import numpy as np
df = pd.read_csv('tips.csv')
def quality(total,tip):
    if tip/total>0.25:
        return 'Generous'
    else:
        return "Other"
'''
one = """
df['tip Quality']=df[["total_bill",'tip']].apply(lambda df: quality(df['total_bill'],df['tip']),1)
"""
two="""
df['tip Quality']=np.vectorize(quality)(df['total_bill'],df['tip'])
"""

In [ ]:
timeit.timeit(setup=stup,stmt=one,number=1000)

In [ ]:
timeit.timeit(setup=stup,stmt=two,number=1000)

In [82]:
df=pd.read_csv('tips.csv')

In [37]:
df

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251
...,...,...,...,...,...,...,...,...,...,...,...
239,29.03,5.92,Male,No,Sat,Dinner,3,9.68,Michael Avila,5296068606052842,Sat2657
240,27.18,2.00,Female,Yes,Sat,Dinner,2,13.59,Monica Sanders,3506806155565404,Sat1766
241,22.67,2.00,Male,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196,Sat3880
242,17.82,1.75,Male,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950,Sat17
243,18.78,3.00,Female,No,Thur,Dinner,2,9.39,Michelle Hardin,3511451626698139,Thur672

In [38]:
reg=pd.DataFrame({"reg_id":[1,2,3,4],
              'name':['sani','ahmed','Nuruddeen','nura']})
log=pd.DataFrame({"login_id":[1,2,3,4],
              'name':['Nuruddeen','nura','mohammed','jalingo']})

In [39]:
reg

   reg_id       name
0       1       sani
1       2      ahmed
2       3  Nuruddeen
3       4       nura

In [40]:
log

   login_id       name
0         1  Nuruddeen
1         2       nura
2         3   mohammed
3         4    jalingo

In [41]:
pd.merge(reg,log)

   reg_id       name  login_id
0       3  Nuruddeen         1
1       4       nura         2

In [42]:
pd.merge(left=reg,right=log,how='left',on='name')

   reg_id       name  login_id
0       1       sani       NaN
1       2      ahmed       NaN
2       3  Nuruddeen       1.0
3       4       nura       2.0

In [43]:
pd.merge(left=reg,right=log,how='right',on='name')

   reg_id       name  login_id
0     3.0  Nuruddeen         1
1     4.0       nura         2
2     NaN   mohammed         3
3     NaN    jalingo         4

In [44]:
pd.merge(left=reg,right=log,how='outer',on='name')

   reg_id       name  login_id
0     1.0       sani       NaN
1     2.0      ahmed       NaN
2     3.0  Nuruddeen       1.0
3     4.0       nura       2.0
4     NaN   mohammed       3.0
5     NaN    jalingo       4.0

In [45]:
reg=reg.set_index('name')

In [46]:
reg

           reg_id
name
sani            1
ahmed           2
Nuruddeen       3
nura            4

In [47]:
pd.merge(left=reg,right=log,how='right',on='name')

        name  reg_id  login_id
0  Nuruddeen     3.0         1
1       nura     4.0         2
2   mohammed     NaN         3
3    jalingo     NaN         4

In [48]:
pd.merge(reg,log,left_index=True,right_on='name',how='inner')

   reg_id  login_id       name
0       3         1  Nuruddeen
1       4         2       nura

In [49]:
reg=reg.reset_index()

In [50]:
reg

        name  reg_id
0       sani       1
1      ahmed       2
2  Nuruddeen       3
3       nura       4

In [51]:
pd.read_csv('example.csv')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [52]:
import pandas as pd

In [53]:
url = 'https://en.wikipedia.org/wiki/World_population'

In [55]:
tables = pd.read_html(url)

In [ ]:
len(tables)

In [ ]:
tables[0]

In [ ]:
wtp = tables[1]

In [ ]:
wtp

In [ ]:
wtp = wtp.drop(11,axis=0)
wtp = wtp.drop('#',axis=1)
wtp.columns = ['Country','2000','2015','2030 Est.']

In [ ]:
tables[5].set_index('Rank')

In [ ]:
wtp.to_html('testing_html.html',index=False)

In [ ]:
pd.read_excel('my_excel_file.xlsx',sheet_name='First_Sheet')

In [ ]:
wb = pd.ExcelFile('my_excel_file.xlsx')
wb.sheet_names

In [ ]:
esd = pd.read_excel('my_excel_file.xlsx',sheet_name=None)

In [ ]:
type(esd)
esd.keys()

In [ ]:
esd

In [ ]:
import pandas as pd
import numpy as np
from sqlalchemy import create_engine

In [ ]:
temp_db = create_engine('sqlite:///:memory:')

In [ ]:
df = pd.DataFrame(data=np.random.randint(low=0,high=100,size=(4,4)),columns=['a','b','c','d'])
df

In [ ]:
df.to_sql(name='New_table',con=temp_db,index=False)

In [ ]:
print(bool(0))

In [ ]:
print(bool('0'))

In [ ]:
pd.read_sql(sql='New_table',con=temp_db)

In [ ]:
num1=int(input('enter starting number: '))
num2=int(input('enter stoping number: '))

In [ ]:
amina(num1,num2)

In [ ]:
for i in range(a,b+1)